using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SharpKnP321.Library
{
    public interface IPeriodic
    {
        String GetPeriod();  // public abstract - за замовчанням
    }
}
/* Інтерфейси
 *  - в цілому - "зміст", зовнішній вигляд, декларація
 *  - набір вимог, "контракт", виконання якого робить об'єкт
 *      належним до функціональних груп (наприклад, USB-пристрої, 
 *      або періодичні видання)
 *  - в теорії ООП - абстрактний клас, у якому є лише відкриті, лише абстрактні
 *      лише методи (не плутати - у C# можливі порушення всіх вимог
 *      для сутності, що описується оператором interface)
 *  - "маркери" - порожні інтерфейси (без методів взагалі), які використовуються
 *      як "дозволи" або як належність до групи
 *  - на практиці - оператор мови програмування, що розрізняє різні типи    
 */
